# LocallyUnloaded Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkType..::..LocallyUnloaded Property
RevitLinkType Class See Also
---
Checks whether a Revit link in a local model is unloaded only for the current user.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool LocallyUnloaded { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LocallyUnloaded As Boolean
	Get
```

Visual C++
---
```text
public:
property bool LocallyUnloaded {
	bool get ();
}
```

# Remarks
Revit links can be unloaded for both the current user and for all users. If a Revit link is in a non-workshared file or in central model, this property is false.
# See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace